10/data/attachments/3df04490f90b3c11.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_bd499d76-c2de-43d5-9c2c-35abbfe1f50d</nif:username>
            <nif:friendToBeAdded>David_record_Actions_40335_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>